Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
  __I  uint32_t CHAVID_LS_DC01;                    /**< CHA Version ID Register, least-significant half, offset: 0x80FEC */
  __I  uint32_t CHANUM_MS_DC01;                    /**< CHA Number Register, most-significant half, offset: 0x80FF0 */
  __I  uint32_t CHANUM_LS_DC01;                    /**< CHA Number Register, least-significant half, offset: 0x80FF4 */
  __I  uint32_t CAAMVID_MS_DC01;                   /**< CAAM Version ID Register, most-significant half, offset: 0x80FF8 */
  __I  uint32_t CAAMVID_LS_DC01;                   /**< CAAM Version ID Register, least-significant half, offset: 0x80FFC */
} CAAM_Type;

/* ----------------------------------------------------------------------------
   -- CAAM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CAAM_Register_Masks CAAM Register Masks
 * @{
 */

/*! @name MCFGR - Master Configuration Register */
/*! @{ */

#define CAAM_MCFGR_NORMAL_BURST_MASK             (0x1U)
#define CAAM_MCFGR_NORMAL_BURST_SHIFT            (0U)
/*! NORMAL_BURST
 *  0b0..Aligned 32 byte burst size target
 *  0b1..Aligned 64 byte burst size target
 */
#define CAAM_MCFGR_NORMAL_BURST(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_NORMAL_BURST_SHIFT)) & CAAM_MCFGR_NORMAL_BURST_MASK)

#define CAAM_MCFGR_LARGE_BURST_MASK              (0x4U)
#define CAAM_MCFGR_LARGE_BURST_SHIFT             (2U)
#define CAAM_MCFGR_LARGE_BURST(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_LARGE_BURST_SHIFT)) & CAAM_MCFGR_LARGE_BURST_MASK)

#define CAAM_MCFGR_AXIPIPE_MASK                  (0xF0U)
#define CAAM_MCFGR_AXIPIPE_SHIFT                 (4U)
#define CAAM_MCFGR_AXIPIPE(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_AXIPIPE_SHIFT)) & CAAM_MCFGR_AXIPIPE_MASK)

#define CAAM_MCFGR_AWCACHE_MASK                  (0xF00U)
#define CAAM_MCFGR_AWCACHE_SHIFT                 (8U)
#define CAAM_MCFGR_AWCACHE(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_AWCACHE_SHIFT)) & CAAM_MCFGR_AWCACHE_MASK)

#define CAAM_MCFGR_ARCACHE_MASK                  (0xF000U)
#define CAAM_MCFGR_ARCACHE_SHIFT                 (12U)
#define CAAM_MCFGR_ARCACHE(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_ARCACHE_SHIFT)) & CAAM_MCFGR_ARCACHE_MASK)

#define CAAM_MCFGR_PS_MASK                       (0x10000U)
#define CAAM_MCFGR_PS_SHIFT                      (16U)
/*! PS
 *  0b0..Pointers fit in one 32-bit word (pointers are 32-bit addresses).
 *  0b1..Pointers require two 32-bit words (pointers are 36-bit addresses).
 */
#define CAAM_MCFGR_PS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_PS_SHIFT)) & CAAM_MCFGR_PS_MASK)

#define CAAM_MCFGR_DWT_MASK                      (0x80000U)
#define CAAM_MCFGR_DWT_SHIFT                     (19U)
#define CAAM_MCFGR_DWT(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_DWT_SHIFT)) & CAAM_MCFGR_DWT_MASK)

#define CAAM_MCFGR_WRHD_MASK                     (0x8000000U)
#define CAAM_MCFGR_WRHD_SHIFT                    (27U)
#define CAAM_MCFGR_WRHD(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_WRHD_SHIFT)) & CAAM_MCFGR_WRHD_MASK)

#define CAAM_MCFGR_DMA_RST_MASK                  (0x10000000U)
#define CAAM_MCFGR_DMA_RST_SHIFT                 (28U)
#define CAAM_MCFGR_DMA_RST(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_DMA_RST_SHIFT)) & CAAM_MCFGR_DMA_RST_MASK)

#define CAAM_MCFGR_WDF_MASK                      (0x20000000U)
#define CAAM_MCFGR_WDF_SHIFT                     (29U)
#define CAAM_MCFGR_WDF(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_WDF_SHIFT)) & CAAM_MCFGR_WDF_MASK)

#define CAAM_MCFGR_WDE_MASK                      (0x40000000U)
#define CAAM_MCFGR_WDE_SHIFT                     (30U)
#define CAAM_MCFGR_WDE(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_WDE_SHIFT)) & CAAM_MCFGR_WDE_MASK)

#define CAAM_MCFGR_SWRST_MASK                    (0x80000000U)
#define CAAM_MCFGR_SWRST_SHIFT                   (31U)
#define CAAM_MCFGR_SWRST(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_MCFGR_SWRST_SHIFT)) & CAAM_MCFGR_SWRST_MASK)
/*! @} */

/*! @name PAGE0_SDID - Page 0 SDID Register */
/*! @{ */

#define CAAM_PAGE0_SDID_SDID_MASK                (0x7FFFU)
#define CAAM_PAGE0_SDID_SDID_SHIFT               (0U)
#define CAAM_PAGE0_SDID_SDID(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_PAGE0_SDID_SDID_SHIFT)) & CAAM_PAGE0_SDID_SDID_MASK)
/*! @} */

/*! @name SCFGR - Security Configuration Register */
/*! @{ */

#define CAAM_SCFGR_PRIBLOB_MASK                  (0x3U)
#define CAAM_SCFGR_PRIBLOB_SHIFT                 (0U)
/*! PRIBLOB
 *  0b00..Private secure boot software blobs
 *  0b01..Private provisioning type 1 blobs
 *  0b10..Private provisioning type 2 blobs
 *  0b11..Normal operation blobs
 */
#define CAAM_SCFGR_PRIBLOB(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SCFGR_PRIBLOB_SHIFT)) & CAAM_SCFGR_PRIBLOB_MASK)

#define CAAM_SCFGR_RNGSH0_MASK                   (0x200U)
#define CAAM_SCFGR_RNGSH0_SHIFT                  (9U)
/*! RNGSH0
 *  0b0..When RNGSH0 is 0, RNG DRNG State Handle 0 can be instantiated in any mode. RNGSH0 is set to 0 only for testing.
 *  0b1..When RNGSH0 is 1, RNG DRNG State Handle 0 cannot be instantiated in deterministic (test) mode. RNGSHO
 *       should be set to 1 before the RNG is instantiated. If it is currently instantiated in a deterministic mode,
 *       it will be un-instantiated. Once this bit has been written to a 1, it cannot be changed to a 0 until the
 *       next power on reset.
 */
#define CAAM_SCFGR_RNGSH0(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_SCFGR_RNGSH0_SHIFT)) & CAAM_SCFGR_RNGSH0_MASK)

#define CAAM_SCFGR_LCK_TRNG_MASK                 (0x800U)
#define CAAM_SCFGR_LCK_TRNG_SHIFT                (11U)
#define CAAM_SCFGR_LCK_TRNG(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_SCFGR_LCK_TRNG_SHIFT)) & CAAM_SCFGR_LCK_TRNG_MASK)

#define CAAM_SCFGR_VIRT_EN_MASK                  (0x8000U)
#define CAAM_SCFGR_VIRT_EN_SHIFT                 (15U)
/*! VIRT_EN
 *  0b0..Disable job ring virtualization
 *  0b1..Enable job ring virtualization
 */
#define CAAM_SCFGR_VIRT_EN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SCFGR_VIRT_EN_SHIFT)) & CAAM_SCFGR_VIRT_EN_MASK)

#define CAAM_SCFGR_MPMRL_MASK                    (0x4000000U)
#define CAAM_SCFGR_MPMRL_SHIFT                   (26U)
#define CAAM_SCFGR_MPMRL(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_SCFGR_MPMRL_SHIFT)) & CAAM_SCFGR_MPMRL_MASK)

#define CAAM_SCFGR_MPPKRC_MASK                   (0x8000000U)
#define CAAM_SCFGR_MPPKRC_SHIFT                  (27U)
#define CAAM_SCFGR_MPPKRC(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_SCFGR_MPPKRC_SHIFT)) & CAAM_SCFGR_MPPKRC_MASK)

#define CAAM_SCFGR_MPCURVE_MASK                  (0xF0000000U)
#define CAAM_SCFGR_MPCURVE_SHIFT                 (28U)
#define CAAM_SCFGR_MPCURVE(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SCFGR_MPCURVE_SHIFT)) & CAAM_SCFGR_MPCURVE_MASK)
/*! @} */

/*! @name JRDID_MS - Job Ring 0 DID Register - most significant half..Job Ring 3 DID Register - most significant half */
/*! @{ */

#define CAAM_JRDID_MS_PRIM_DID_MASK              (0xFU)
#define CAAM_JRDID_MS_PRIM_DID_SHIFT             (0U)
#define CAAM_JRDID_MS_PRIM_DID(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_JRDID_MS_PRIM_DID_SHIFT)) & CAAM_JRDID_MS_PRIM_DID_MASK)

