Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
#define CAAM_RTIC_OWN_ROWN_DID_MASK              (0xFU)
#define CAAM_RTIC_OWN_ROWN_DID_SHIFT             (0U)
/*! ROWN_DID - RTIC Owner's DID */
#define CAAM_RTIC_OWN_ROWN_DID(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_RTIC_OWN_ROWN_DID_SHIFT)) & CAAM_RTIC_OWN_ROWN_DID_MASK)

#define CAAM_RTIC_OWN_ROWN_TZ_MASK               (0x10U)
#define CAAM_RTIC_OWN_ROWN_TZ_SHIFT              (4U)
#define CAAM_RTIC_OWN_ROWN_TZ(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTIC_OWN_ROWN_TZ_SHIFT)) & CAAM_RTIC_OWN_ROWN_TZ_MASK)

#define CAAM_RTIC_OWN_LCK_MASK                   (0x80000000U)
#define CAAM_RTIC_OWN_LCK_SHIFT                  (31U)
#define CAAM_RTIC_OWN_LCK(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_RTIC_OWN_LCK_SHIFT)) & CAAM_RTIC_OWN_LCK_MASK)
/*! @} */

/*! @name RTIC_DID - RTIC DID Register for Block A..RTIC DID Register for Block D */
/*! @{ */

#define CAAM_RTIC_DID_RTIC_DID_MASK              (0xFU)
#define CAAM_RTIC_DID_RTIC_DID_SHIFT             (0U)
#define CAAM_RTIC_DID_RTIC_DID(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_RTIC_DID_RTIC_DID_SHIFT)) & CAAM_RTIC_DID_RTIC_DID_MASK)

#define CAAM_RTIC_DID_RTIC_TZ_MASK               (0x10U)
#define CAAM_RTIC_DID_RTIC_TZ_SHIFT              (4U)
#define CAAM_RTIC_DID_RTIC_TZ(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTIC_DID_RTIC_TZ_SHIFT)) & CAAM_RTIC_DID_RTIC_TZ_MASK)

#define CAAM_RTIC_DID_RTIC_ICID_MASK             (0x3FF80000U)
#define CAAM_RTIC_DID_RTIC_ICID_SHIFT            (19U)
#define CAAM_RTIC_DID_RTIC_ICID(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTIC_DID_RTIC_ICID_SHIFT)) & CAAM_RTIC_DID_RTIC_ICID_MASK)
/*! @} */

/* The count of CAAM_RTIC_DID */
#define CAAM_RTIC_DID_COUNT                      (4U)

/*! @name DECORSR - DECO Request Source Register */
/*! @{ */

#define CAAM_DECORSR_JR_MASK                     (0x3U)
#define CAAM_DECORSR_JR_SHIFT                    (0U)
#define CAAM_DECORSR_JR(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_DECORSR_JR_SHIFT)) & CAAM_DECORSR_JR_MASK)

#define CAAM_DECORSR_VALID_MASK                  (0x80000000U)
#define CAAM_DECORSR_VALID_SHIFT                 (31U)
#define CAAM_DECORSR_VALID(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_DECORSR_VALID_SHIFT)) & CAAM_DECORSR_VALID_MASK)
/*! @} */

/*! @name DECORR - DECO Request Register */
/*! @{ */

#define CAAM_DECORR_RQD0_MASK                    (0x1U)
#define CAAM_DECORR_RQD0_SHIFT                   (0U)
#define CAAM_DECORR_RQD0(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_DECORR_RQD0_SHIFT)) & CAAM_DECORR_RQD0_MASK)

#define CAAM_DECORR_DEN0_MASK                    (0x10000U)
#define CAAM_DECORR_DEN0_SHIFT                   (16U)
#define CAAM_DECORR_DEN0(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_DECORR_DEN0_SHIFT)) & CAAM_DECORR_DEN0_MASK)
/*! @} */

/*! @name DECODID_MS - DECO0 DID Register - most significant half */
/*! @{ */

#define CAAM_DECODID_MS_DPRIM_DID_MASK           (0xFU)
#define CAAM_DECODID_MS_DPRIM_DID_SHIFT          (0U)
/*! DPRIM_DID - DECO Owner */
#define CAAM_DECODID_MS_DPRIM_DID(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_DECODID_MS_DPRIM_DID_SHIFT)) & CAAM_DECODID_MS_DPRIM_DID_MASK)

#define CAAM_DECODID_MS_D_NS_MASK                (0x10U)
#define CAAM_DECODID_MS_D_NS_SHIFT               (4U)
#define CAAM_DECODID_MS_D_NS(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_DECODID_MS_D_NS_SHIFT)) & CAAM_DECODID_MS_D_NS_MASK)

#define CAAM_DECODID_MS_LCK_MASK                 (0x80000000U)
#define CAAM_DECODID_MS_LCK_SHIFT                (31U)
#define CAAM_DECODID_MS_LCK(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_DECODID_MS_LCK_SHIFT)) & CAAM_DECODID_MS_LCK_MASK)
/*! @} */

/* The count of CAAM_DECODID_MS */
#define CAAM_DECODID_MS_COUNT                    (1U)

/*! @name DECODID_LS - DECO0 DID Register - least significant half */
/*! @{ */

#define CAAM_DECODID_LS_DSEQ_DID_MASK            (0xFU)
#define CAAM_DECODID_LS_DSEQ_DID_SHIFT           (0U)
#define CAAM_DECODID_LS_DSEQ_DID(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DECODID_LS_DSEQ_DID_SHIFT)) & CAAM_DECODID_LS_DSEQ_DID_MASK)

#define CAAM_DECODID_LS_DSEQ_NS_MASK             (0x10U)
#define CAAM_DECODID_LS_DSEQ_NS_SHIFT            (4U)
#define CAAM_DECODID_LS_DSEQ_NS(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DECODID_LS_DSEQ_NS_SHIFT)) & CAAM_DECODID_LS_DSEQ_NS_MASK)

#define CAAM_DECODID_LS_DNSEQ_DID_MASK           (0xF0000U)
#define CAAM_DECODID_LS_DNSEQ_DID_SHIFT          (16U)
#define CAAM_DECODID_LS_DNSEQ_DID(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_DECODID_LS_DNSEQ_DID_SHIFT)) & CAAM_DECODID_LS_DNSEQ_DID_MASK)

#define CAAM_DECODID_LS_DNONSEQ_NS_MASK          (0x100000U)
#define CAAM_DECODID_LS_DNONSEQ_NS_SHIFT         (20U)
#define CAAM_DECODID_LS_DNONSEQ_NS(x)            (((uint32_t)(((uint32_t)(x)) << CAAM_DECODID_LS_DNONSEQ_NS_SHIFT)) & CAAM_DECODID_LS_DNONSEQ_NS_MASK)
/*! @} */

/* The count of CAAM_DECODID_LS */
#define CAAM_DECODID_LS_COUNT                    (1U)

/*! @name DAR - DECO Availability Register */
/*! @{ */

#define CAAM_DAR_NYA0_MASK                       (0x1U)
#define CAAM_DAR_NYA0_SHIFT                      (0U)
#define CAAM_DAR_NYA0(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DAR_NYA0_SHIFT)) & CAAM_DAR_NYA0_MASK)
/*! @} */

/*! @name DRR - DECO Reset Register */
/*! @{ */

#define CAAM_DRR_RST0_MASK                       (0x1U)
#define CAAM_DRR_RST0_SHIFT                      (0U)
#define CAAM_DRR_RST0(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_DRR_RST0_SHIFT)) & CAAM_DRR_RST0_MASK)
/*! @} */

/*! @name JRSMVBAR - Job Ring 0 Secure Memory Virtual Base Address Register..Job Ring 3 Secure Memory Virtual Base Address Register */
/*! @{ */

#define CAAM_JRSMVBAR_SMVBA_MASK                 (0xFFFFFFFFU)
#define CAAM_JRSMVBAR_SMVBA_SHIFT                (0U)
#define CAAM_JRSMVBAR_SMVBA(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_JRSMVBAR_SMVBA_SHIFT)) & CAAM_JRSMVBAR_SMVBA_MASK)
/*! @} */

/* The count of CAAM_JRSMVBAR */
#define CAAM_JRSMVBAR_COUNT                      (4U)

/*! @name PBSL - Peak Bandwidth Smoothing Limit Register */
/*! @{ */

