Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
#define CAAM_DMA_X_AID_15_0_EN_AID14E_MASK       (0x4000U)
#define CAAM_DMA_X_AID_15_0_EN_AID14E_SHIFT      (14U)
#define CAAM_DMA_X_AID_15_0_EN_AID14E(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AID_15_0_EN_AID14E_SHIFT)) & CAAM_DMA_X_AID_15_0_EN_AID14E_MASK)

#define CAAM_DMA_X_AID_15_0_EN_AID15E_MASK       (0x8000U)
#define CAAM_DMA_X_AID_15_0_EN_AID15E_SHIFT      (15U)
#define CAAM_DMA_X_AID_15_0_EN_AID15E(x)         (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AID_15_0_EN_AID15E_SHIFT)) & CAAM_DMA_X_AID_15_0_EN_AID15E_MASK)
/*! @} */

/*! @name DMA_X_ARTC_CTL - DMA_X AXI Read Timing Check Control Register */
/*! @{ */

#define CAAM_DMA_X_ARTC_CTL_ART_MASK             (0xFFFU)
#define CAAM_DMA_X_ARTC_CTL_ART_SHIFT            (0U)
#define CAAM_DMA_X_ARTC_CTL_ART(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_ARTC_CTL_ART_SHIFT)) & CAAM_DMA_X_ARTC_CTL_ART_MASK)

#define CAAM_DMA_X_ARTC_CTL_ARL_MASK             (0xFFF0000U)
#define CAAM_DMA_X_ARTC_CTL_ARL_SHIFT            (16U)
#define CAAM_DMA_X_ARTC_CTL_ARL(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_ARTC_CTL_ARL_SHIFT)) & CAAM_DMA_X_ARTC_CTL_ARL_MASK)

#define CAAM_DMA_X_ARTC_CTL_ARTL_MASK            (0x10000000U)
#define CAAM_DMA_X_ARTC_CTL_ARTL_SHIFT           (28U)
#define CAAM_DMA_X_ARTC_CTL_ARTL(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_ARTC_CTL_ARTL_SHIFT)) & CAAM_DMA_X_ARTC_CTL_ARTL_MASK)

#define CAAM_DMA_X_ARTC_CTL_ARTT_MASK            (0x20000000U)
#define CAAM_DMA_X_ARTC_CTL_ARTT_SHIFT           (29U)
#define CAAM_DMA_X_ARTC_CTL_ARTT(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_ARTC_CTL_ARTT_SHIFT)) & CAAM_DMA_X_ARTC_CTL_ARTT_MASK)

#define CAAM_DMA_X_ARTC_CTL_ARCT_MASK            (0x40000000U)
#define CAAM_DMA_X_ARTC_CTL_ARCT_SHIFT           (30U)
#define CAAM_DMA_X_ARTC_CTL_ARCT(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_ARTC_CTL_ARCT_SHIFT)) & CAAM_DMA_X_ARTC_CTL_ARCT_MASK)

#define CAAM_DMA_X_ARTC_CTL_ARTCE_MASK           (0x80000000U)
#define CAAM_DMA_X_ARTC_CTL_ARTCE_SHIFT          (31U)
#define CAAM_DMA_X_ARTC_CTL_ARTCE(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_ARTC_CTL_ARTCE_SHIFT)) & CAAM_DMA_X_ARTC_CTL_ARTCE_MASK)
/*! @} */

/*! @name DMA_X_ARTC_LC - DMA_X AXI Read Timing Check Late Count Register */
/*! @{ */

#define CAAM_DMA_X_ARTC_LC_ARLC_MASK             (0xFFFFFU)
#define CAAM_DMA_X_ARTC_LC_ARLC_SHIFT            (0U)
#define CAAM_DMA_X_ARTC_LC_ARLC(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_ARTC_LC_ARLC_SHIFT)) & CAAM_DMA_X_ARTC_LC_ARLC_MASK)
/*! @} */

/*! @name DMA_X_ARTC_SC - DMA_X AXI Read Timing Check Sample Count Register */
/*! @{ */

#define CAAM_DMA_X_ARTC_SC_ARSC_MASK             (0xFFFFFU)
#define CAAM_DMA_X_ARTC_SC_ARSC_SHIFT            (0U)
#define CAAM_DMA_X_ARTC_SC_ARSC(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_ARTC_SC_ARSC_SHIFT)) & CAAM_DMA_X_ARTC_SC_ARSC_MASK)
/*! @} */

/*! @name DMA_X_ARTC_LAT - DMA_X Read Timing Check Latency Register */
/*! @{ */

#define CAAM_DMA_X_ARTC_LAT_SARL_MASK            (0xFFFFFFFFU)
#define CAAM_DMA_X_ARTC_LAT_SARL_SHIFT           (0U)
#define CAAM_DMA_X_ARTC_LAT_SARL(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_ARTC_LAT_SARL_SHIFT)) & CAAM_DMA_X_ARTC_LAT_SARL_MASK)
/*! @} */

/*! @name DMA_X_AWTC_CTL - DMA_X AXI Write Timing Check Control Register */
/*! @{ */

#define CAAM_DMA_X_AWTC_CTL_AWT_MASK             (0xFFFU)
#define CAAM_DMA_X_AWTC_CTL_AWT_SHIFT            (0U)
#define CAAM_DMA_X_AWTC_CTL_AWT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AWTC_CTL_AWT_SHIFT)) & CAAM_DMA_X_AWTC_CTL_AWT_MASK)

#define CAAM_DMA_X_AWTC_CTL_AWL_MASK             (0xFFF0000U)
#define CAAM_DMA_X_AWTC_CTL_AWL_SHIFT            (16U)
#define CAAM_DMA_X_AWTC_CTL_AWL(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AWTC_CTL_AWL_SHIFT)) & CAAM_DMA_X_AWTC_CTL_AWL_MASK)

#define CAAM_DMA_X_AWTC_CTL_AWTT_MASK            (0x20000000U)
#define CAAM_DMA_X_AWTC_CTL_AWTT_SHIFT           (29U)
#define CAAM_DMA_X_AWTC_CTL_AWTT(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AWTC_CTL_AWTT_SHIFT)) & CAAM_DMA_X_AWTC_CTL_AWTT_MASK)

#define CAAM_DMA_X_AWTC_CTL_AWCT_MASK            (0x40000000U)
#define CAAM_DMA_X_AWTC_CTL_AWCT_SHIFT           (30U)
#define CAAM_DMA_X_AWTC_CTL_AWCT(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AWTC_CTL_AWCT_SHIFT)) & CAAM_DMA_X_AWTC_CTL_AWCT_MASK)

#define CAAM_DMA_X_AWTC_CTL_AWTCE_MASK           (0x80000000U)
#define CAAM_DMA_X_AWTC_CTL_AWTCE_SHIFT          (31U)
#define CAAM_DMA_X_AWTC_CTL_AWTCE(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AWTC_CTL_AWTCE_SHIFT)) & CAAM_DMA_X_AWTC_CTL_AWTCE_MASK)
/*! @} */

/*! @name DMA_X_AWTC_LC - DMA_X AXI Write Timing Check Late Count Register */
/*! @{ */

#define CAAM_DMA_X_AWTC_LC_AWLC_MASK             (0xFFFFFU)
#define CAAM_DMA_X_AWTC_LC_AWLC_SHIFT            (0U)
#define CAAM_DMA_X_AWTC_LC_AWLC(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AWTC_LC_AWLC_SHIFT)) & CAAM_DMA_X_AWTC_LC_AWLC_MASK)
/*! @} */

/*! @name DMA_X_AWTC_SC - DMA_X AXI Write Timing Check Sample Count Register */
/*! @{ */

#define CAAM_DMA_X_AWTC_SC_AWSC_MASK             (0xFFFFFU)
#define CAAM_DMA_X_AWTC_SC_AWSC_SHIFT            (0U)
#define CAAM_DMA_X_AWTC_SC_AWSC(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AWTC_SC_AWSC_SHIFT)) & CAAM_DMA_X_AWTC_SC_AWSC_MASK)
/*! @} */

/*! @name DMA_X_AWTC_LAT - DMA_X Write Timing Check Latency Register */
/*! @{ */

#define CAAM_DMA_X_AWTC_LAT_SAWL_MASK            (0xFFFFFFFFU)
#define CAAM_DMA_X_AWTC_LAT_SAWL_SHIFT           (0U)
#define CAAM_DMA_X_AWTC_LAT_SAWL(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_DMA_X_AWTC_LAT_SAWL_SHIFT)) & CAAM_DMA_X_AWTC_LAT_SAWL_MASK)
/*! @} */

/*! @name RTMCTL - RNG TRNG Miscellaneous Control Register */
/*! @{ */

#define CAAM_RTMCTL_SAMP_MODE_MASK               (0x3U)
#define CAAM_RTMCTL_SAMP_MODE_SHIFT              (0U)
/*! SAMP_MODE
 *  0b00..use Von Neumann data into both Entropy shifter and Statistical Checker
 *  0b01..use raw data into both Entropy shifter and Statistical Checker
 *  0b10..use Von Neumann data into Entropy shifter. Use raw data into Statistical Checker
 *  0b11..undefined/reserved.
 */
#define CAAM_RTMCTL_SAMP_MODE(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_SAMP_MODE_SHIFT)) & CAAM_RTMCTL_SAMP_MODE_MASK)

#define CAAM_RTMCTL_OSC_DIV_MASK                 (0xCU)
#define CAAM_RTMCTL_OSC_DIV_SHIFT                (2U)
/*! OSC_DIV
 *  0b00..use ring oscillator with no divide
 *  0b01..use ring oscillator divided-by-2
 *  0b10..use ring oscillator divided-by-4
 *  0b11..use ring oscillator divided-by-8
 */
#define CAAM_RTMCTL_OSC_DIV(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTMCTL_OSC_DIV_SHIFT)) & CAAM_RTMCTL_OSC_DIV_MASK)

