Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
/*! @name RTSCMC - RNG TRNG Statistical Check Monobit Count Register */
/*! @{ */

#define CAAM_RTSCMC_MONO_CNT_MASK                (0xFFFFU)
#define CAAM_RTSCMC_MONO_CNT_SHIFT               (0U)
#define CAAM_RTSCMC_MONO_CNT(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCMC_MONO_CNT_SHIFT)) & CAAM_RTSCMC_MONO_CNT_MASK)
/*! @} */

/*! @name RTSCR1C - RNG TRNG Statistical Check Run Length 1 Count Register */
/*! @{ */

#define CAAM_RTSCR1C_R1_0_COUNT_MASK             (0x7FFFU)
#define CAAM_RTSCR1C_R1_0_COUNT_SHIFT            (0U)
#define CAAM_RTSCR1C_R1_0_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR1C_R1_0_COUNT_SHIFT)) & CAAM_RTSCR1C_R1_0_COUNT_MASK)

#define CAAM_RTSCR1C_R1_1_COUNT_MASK             (0x7FFF0000U)
#define CAAM_RTSCR1C_R1_1_COUNT_SHIFT            (16U)
#define CAAM_RTSCR1C_R1_1_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR1C_R1_1_COUNT_SHIFT)) & CAAM_RTSCR1C_R1_1_COUNT_MASK)
/*! @} */

/*! @name RTSCR2C - RNG TRNG Statistical Check Run Length 2 Count Register */
/*! @{ */

#define CAAM_RTSCR2C_R2_0_COUNT_MASK             (0x3FFFU)
#define CAAM_RTSCR2C_R2_0_COUNT_SHIFT            (0U)
#define CAAM_RTSCR2C_R2_0_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR2C_R2_0_COUNT_SHIFT)) & CAAM_RTSCR2C_R2_0_COUNT_MASK)

#define CAAM_RTSCR2C_R2_1_COUNT_MASK             (0x3FFF0000U)
#define CAAM_RTSCR2C_R2_1_COUNT_SHIFT            (16U)
#define CAAM_RTSCR2C_R2_1_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR2C_R2_1_COUNT_SHIFT)) & CAAM_RTSCR2C_R2_1_COUNT_MASK)
/*! @} */

/*! @name RTSCR3C - RNG TRNG Statistical Check Run Length 3 Count Register */
/*! @{ */

#define CAAM_RTSCR3C_R3_0_COUNT_MASK             (0x1FFFU)
#define CAAM_RTSCR3C_R3_0_COUNT_SHIFT            (0U)
#define CAAM_RTSCR3C_R3_0_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR3C_R3_0_COUNT_SHIFT)) & CAAM_RTSCR3C_R3_0_COUNT_MASK)

#define CAAM_RTSCR3C_R3_1_COUNT_MASK             (0x1FFF0000U)
#define CAAM_RTSCR3C_R3_1_COUNT_SHIFT            (16U)
#define CAAM_RTSCR3C_R3_1_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR3C_R3_1_COUNT_SHIFT)) & CAAM_RTSCR3C_R3_1_COUNT_MASK)
/*! @} */

/*! @name RTSCR4C - RNG TRNG Statistical Check Run Length 4 Count Register */
/*! @{ */

#define CAAM_RTSCR4C_R4_0_COUNT_MASK             (0xFFFU)
#define CAAM_RTSCR4C_R4_0_COUNT_SHIFT            (0U)
#define CAAM_RTSCR4C_R4_0_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR4C_R4_0_COUNT_SHIFT)) & CAAM_RTSCR4C_R4_0_COUNT_MASK)

#define CAAM_RTSCR4C_R4_1_COUNT_MASK             (0xFFF0000U)
#define CAAM_RTSCR4C_R4_1_COUNT_SHIFT            (16U)
#define CAAM_RTSCR4C_R4_1_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR4C_R4_1_COUNT_SHIFT)) & CAAM_RTSCR4C_R4_1_COUNT_MASK)
/*! @} */

/*! @name RTSCR5C - RNG TRNG Statistical Check Run Length 5 Count Register */
/*! @{ */

#define CAAM_RTSCR5C_R5_0_COUNT_MASK             (0x7FFU)
#define CAAM_RTSCR5C_R5_0_COUNT_SHIFT            (0U)
#define CAAM_RTSCR5C_R5_0_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR5C_R5_0_COUNT_SHIFT)) & CAAM_RTSCR5C_R5_0_COUNT_MASK)

#define CAAM_RTSCR5C_R5_1_COUNT_MASK             (0x7FF0000U)
#define CAAM_RTSCR5C_R5_1_COUNT_SHIFT            (16U)
#define CAAM_RTSCR5C_R5_1_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR5C_R5_1_COUNT_SHIFT)) & CAAM_RTSCR5C_R5_1_COUNT_MASK)
/*! @} */

/*! @name RTSCR6PC - RNG TRNG Statistical Check Run Length 6+ Count Register */
/*! @{ */

#define CAAM_RTSCR6PC_R6P_0_COUNT_MASK           (0x7FFU)
#define CAAM_RTSCR6PC_R6P_0_COUNT_SHIFT          (0U)
#define CAAM_RTSCR6PC_R6P_0_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR6PC_R6P_0_COUNT_SHIFT)) & CAAM_RTSCR6PC_R6P_0_COUNT_MASK)

#define CAAM_RTSCR6PC_R6P_1_COUNT_MASK           (0x7FF0000U)
#define CAAM_RTSCR6PC_R6P_1_COUNT_SHIFT          (16U)
#define CAAM_RTSCR6PC_R6P_1_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR6PC_R6P_1_COUNT_SHIFT)) & CAAM_RTSCR6PC_R6P_1_COUNT_MASK)
/*! @} */

/*! @name RTFRQMAX - RNG TRNG Frequency Count Maximum Limit Register */
/*! @{ */

#define CAAM_RTFRQMAX_FRQ_MAX_MASK               (0x3FFFFFU)
#define CAAM_RTFRQMAX_FRQ_MAX_SHIFT              (0U)
#define CAAM_RTFRQMAX_FRQ_MAX(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTFRQMAX_FRQ_MAX_SHIFT)) & CAAM_RTFRQMAX_FRQ_MAX_MASK)
/*! @} */

/*! @name RTSCML - RNG TRNG Statistical Check Monobit Limit Register */
/*! @{ */

#define CAAM_RTSCML_MONO_MAX_MASK                (0xFFFFU)
#define CAAM_RTSCML_MONO_MAX_SHIFT               (0U)
#define CAAM_RTSCML_MONO_MAX(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCML_MONO_MAX_SHIFT)) & CAAM_RTSCML_MONO_MAX_MASK)

#define CAAM_RTSCML_MONO_RNG_MASK                (0xFFFF0000U)
#define CAAM_RTSCML_MONO_RNG_SHIFT               (16U)
#define CAAM_RTSCML_MONO_RNG(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCML_MONO_RNG_SHIFT)) & CAAM_RTSCML_MONO_RNG_MASK)
/*! @} */

/*! @name RTSCR1L - RNG TRNG Statistical Check Run Length 1 Limit Register */
/*! @{ */

#define CAAM_RTSCR1L_RUN1_MAX_MASK               (0x7FFFU)
#define CAAM_RTSCR1L_RUN1_MAX_SHIFT              (0U)
#define CAAM_RTSCR1L_RUN1_MAX(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR1L_RUN1_MAX_SHIFT)) & CAAM_RTSCR1L_RUN1_MAX_MASK)

#define CAAM_RTSCR1L_RUN1_RNG_MASK               (0x7FFF0000U)
#define CAAM_RTSCR1L_RUN1_RNG_SHIFT              (16U)
#define CAAM_RTSCR1L_RUN1_RNG(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR1L_RUN1_RNG_SHIFT)) & CAAM_RTSCR1L_RUN1_RNG_MASK)
/*! @} */

/*! @name RTSCR2L - RNG TRNG Statistical Check Run Length 2 Limit Register */
/*! @{ */

#define CAAM_RTSCR2L_RUN2_MAX_MASK               (0x3FFFU)
#define CAAM_RTSCR2L_RUN2_MAX_SHIFT              (0U)
#define CAAM_RTSCR2L_RUN2_MAX(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR2L_RUN2_MAX_SHIFT)) & CAAM_RTSCR2L_RUN2_MAX_MASK)

#define CAAM_RTSCR2L_RUN2_RNG_MASK               (0x3FFF0000U)
#define CAAM_RTSCR2L_RUN2_RNG_SHIFT              (16U)
#define CAAM_RTSCR2L_RUN2_RNG(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR2L_RUN2_RNG_SHIFT)) & CAAM_RTSCR2L_RUN2_RNG_MASK)
/*! @} */

