Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
/*! @name RTSCR3L - RNG TRNG Statistical Check Run Length 3 Limit Register */
/*! @{ */

#define CAAM_RTSCR3L_RUN3_MAX_MASK               (0x1FFFU)
#define CAAM_RTSCR3L_RUN3_MAX_SHIFT              (0U)
#define CAAM_RTSCR3L_RUN3_MAX(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR3L_RUN3_MAX_SHIFT)) & CAAM_RTSCR3L_RUN3_MAX_MASK)

#define CAAM_RTSCR3L_RUN3_RNG_MASK               (0x1FFF0000U)
#define CAAM_RTSCR3L_RUN3_RNG_SHIFT              (16U)
#define CAAM_RTSCR3L_RUN3_RNG(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR3L_RUN3_RNG_SHIFT)) & CAAM_RTSCR3L_RUN3_RNG_MASK)
/*! @} */

/*! @name RTSCR4L - RNG TRNG Statistical Check Run Length 4 Limit Register */
/*! @{ */

#define CAAM_RTSCR4L_RUN4_MAX_MASK               (0xFFFU)
#define CAAM_RTSCR4L_RUN4_MAX_SHIFT              (0U)
#define CAAM_RTSCR4L_RUN4_MAX(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR4L_RUN4_MAX_SHIFT)) & CAAM_RTSCR4L_RUN4_MAX_MASK)

#define CAAM_RTSCR4L_RUN4_RNG_MASK               (0xFFF0000U)
#define CAAM_RTSCR4L_RUN4_RNG_SHIFT              (16U)
#define CAAM_RTSCR4L_RUN4_RNG(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR4L_RUN4_RNG_SHIFT)) & CAAM_RTSCR4L_RUN4_RNG_MASK)
/*! @} */

/*! @name RTSCR5L - RNG TRNG Statistical Check Run Length 5 Limit Register */
/*! @{ */

#define CAAM_RTSCR5L_RUN5_MAX_MASK               (0x7FFU)
#define CAAM_RTSCR5L_RUN5_MAX_SHIFT              (0U)
#define CAAM_RTSCR5L_RUN5_MAX(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR5L_RUN5_MAX_SHIFT)) & CAAM_RTSCR5L_RUN5_MAX_MASK)

#define CAAM_RTSCR5L_RUN5_RNG_MASK               (0x7FF0000U)
#define CAAM_RTSCR5L_RUN5_RNG_SHIFT              (16U)
#define CAAM_RTSCR5L_RUN5_RNG(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR5L_RUN5_RNG_SHIFT)) & CAAM_RTSCR5L_RUN5_RNG_MASK)
/*! @} */

/*! @name RTSCR6PL - RNG TRNG Statistical Check Run Length 6+ Limit Register */
/*! @{ */

#define CAAM_RTSCR6PL_RUN6P_MAX_MASK             (0x7FFU)
#define CAAM_RTSCR6PL_RUN6P_MAX_SHIFT            (0U)
#define CAAM_RTSCR6PL_RUN6P_MAX(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR6PL_RUN6P_MAX_SHIFT)) & CAAM_RTSCR6PL_RUN6P_MAX_MASK)

#define CAAM_RTSCR6PL_RUN6P_RNG_MASK             (0x7FF0000U)
#define CAAM_RTSCR6PL_RUN6P_RNG_SHIFT            (16U)
#define CAAM_RTSCR6PL_RUN6P_RNG(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_RTSCR6PL_RUN6P_RNG_SHIFT)) & CAAM_RTSCR6PL_RUN6P_RNG_MASK)
/*! @} */

/*! @name RTSTATUS - RNG TRNG Status Register */
/*! @{ */

#define CAAM_RTSTATUS_F1BR0TF_MASK               (0x1U)
#define CAAM_RTSTATUS_F1BR0TF_SHIFT              (0U)
#define CAAM_RTSTATUS_F1BR0TF(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F1BR0TF_SHIFT)) & CAAM_RTSTATUS_F1BR0TF_MASK)

#define CAAM_RTSTATUS_F1BR1TF_MASK               (0x2U)
#define CAAM_RTSTATUS_F1BR1TF_SHIFT              (1U)
#define CAAM_RTSTATUS_F1BR1TF(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F1BR1TF_SHIFT)) & CAAM_RTSTATUS_F1BR1TF_MASK)

#define CAAM_RTSTATUS_F2BR0TF_MASK               (0x4U)
#define CAAM_RTSTATUS_F2BR0TF_SHIFT              (2U)
#define CAAM_RTSTATUS_F2BR0TF(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F2BR0TF_SHIFT)) & CAAM_RTSTATUS_F2BR0TF_MASK)

#define CAAM_RTSTATUS_F2BR1TF_MASK               (0x8U)
#define CAAM_RTSTATUS_F2BR1TF_SHIFT              (3U)
#define CAAM_RTSTATUS_F2BR1TF(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F2BR1TF_SHIFT)) & CAAM_RTSTATUS_F2BR1TF_MASK)

#define CAAM_RTSTATUS_F3BR01TF_MASK              (0x10U)
#define CAAM_RTSTATUS_F3BR01TF_SHIFT             (4U)
#define CAAM_RTSTATUS_F3BR01TF(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F3BR01TF_SHIFT)) & CAAM_RTSTATUS_F3BR01TF_MASK)

#define CAAM_RTSTATUS_F3BR1TF_MASK               (0x20U)
#define CAAM_RTSTATUS_F3BR1TF_SHIFT              (5U)
#define CAAM_RTSTATUS_F3BR1TF(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F3BR1TF_SHIFT)) & CAAM_RTSTATUS_F3BR1TF_MASK)

#define CAAM_RTSTATUS_F4BR0TF_MASK               (0x40U)
#define CAAM_RTSTATUS_F4BR0TF_SHIFT              (6U)
#define CAAM_RTSTATUS_F4BR0TF(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F4BR0TF_SHIFT)) & CAAM_RTSTATUS_F4BR0TF_MASK)

#define CAAM_RTSTATUS_F4BR1TF_MASK               (0x80U)
#define CAAM_RTSTATUS_F4BR1TF_SHIFT              (7U)
#define CAAM_RTSTATUS_F4BR1TF(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F4BR1TF_SHIFT)) & CAAM_RTSTATUS_F4BR1TF_MASK)

#define CAAM_RTSTATUS_F5BR0TF_MASK               (0x100U)
#define CAAM_RTSTATUS_F5BR0TF_SHIFT              (8U)
#define CAAM_RTSTATUS_F5BR0TF(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F5BR0TF_SHIFT)) & CAAM_RTSTATUS_F5BR0TF_MASK)

#define CAAM_RTSTATUS_F5BR1TF_MASK               (0x200U)
#define CAAM_RTSTATUS_F5BR1TF_SHIFT              (9U)
#define CAAM_RTSTATUS_F5BR1TF(x)                 (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F5BR1TF_SHIFT)) & CAAM_RTSTATUS_F5BR1TF_MASK)

#define CAAM_RTSTATUS_F6PBR0TF_MASK              (0x400U)
#define CAAM_RTSTATUS_F6PBR0TF_SHIFT             (10U)
#define CAAM_RTSTATUS_F6PBR0TF(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F6PBR0TF_SHIFT)) & CAAM_RTSTATUS_F6PBR0TF_MASK)

#define CAAM_RTSTATUS_F6PBR1TF_MASK              (0x800U)
#define CAAM_RTSTATUS_F6PBR1TF_SHIFT             (11U)
#define CAAM_RTSTATUS_F6PBR1TF(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_F6PBR1TF_SHIFT)) & CAAM_RTSTATUS_F6PBR1TF_MASK)

#define CAAM_RTSTATUS_FSBTF_MASK                 (0x1000U)
#define CAAM_RTSTATUS_FSBTF_SHIFT                (12U)
#define CAAM_RTSTATUS_FSBTF(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_FSBTF_SHIFT)) & CAAM_RTSTATUS_FSBTF_MASK)

#define CAAM_RTSTATUS_FLRTF_MASK                 (0x2000U)
#define CAAM_RTSTATUS_FLRTF_SHIFT                (13U)
#define CAAM_RTSTATUS_FLRTF(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_FLRTF_SHIFT)) & CAAM_RTSTATUS_FLRTF_MASK)

#define CAAM_RTSTATUS_FPTF_MASK                  (0x4000U)
#define CAAM_RTSTATUS_FPTF_SHIFT                 (14U)
#define CAAM_RTSTATUS_FPTF(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_FPTF_SHIFT)) & CAAM_RTSTATUS_FPTF_MASK)

#define CAAM_RTSTATUS_FMBTF_MASK                 (0x8000U)
#define CAAM_RTSTATUS_FMBTF_SHIFT                (15U)
#define CAAM_RTSTATUS_FMBTF(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_FMBTF_SHIFT)) & CAAM_RTSTATUS_FMBTF_MASK)

#define CAAM_RTSTATUS_RETRY_COUNT_MASK           (0xF0000U)
#define CAAM_RTSTATUS_RETRY_COUNT_SHIFT          (16U)
#define CAAM_RTSTATUS_RETRY_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTSTATUS_RETRY_COUNT_SHIFT)) & CAAM_RTSTATUS_RETRY_COUNT_MASK)
/*! @} */

/*! @name RTENT - RNG TRNG Entropy Read Register */
/*! @{ */

#define CAAM_RTENT_ENT_MASK                      (0xFFFFFFFFU)
#define CAAM_RTENT_ENT_SHIFT                     (0U)
#define CAAM_RTENT_ENT(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RTENT_ENT_SHIFT)) & CAAM_RTENT_ENT_MASK)
/*! @} */

/* The count of CAAM_RTENT */
#define CAAM_RTENT_COUNT                         (16U)

