Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
/*! @name RTPKRCNT10 - RNG TRNG Statistical Check Poker Count 1 and 0 Register */
/*! @{ */

#define CAAM_RTPKRCNT10_PKR_0_CNT_MASK           (0xFFFFU)
#define CAAM_RTPKRCNT10_PKR_0_CNT_SHIFT          (0U)
#define CAAM_RTPKRCNT10_PKR_0_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT10_PKR_0_CNT_SHIFT)) & CAAM_RTPKRCNT10_PKR_0_CNT_MASK)

#define CAAM_RTPKRCNT10_PKR_1_CNT_MASK           (0xFFFF0000U)
#define CAAM_RTPKRCNT10_PKR_1_CNT_SHIFT          (16U)
#define CAAM_RTPKRCNT10_PKR_1_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT10_PKR_1_CNT_SHIFT)) & CAAM_RTPKRCNT10_PKR_1_CNT_MASK)
/*! @} */

/*! @name RTPKRCNT32 - RNG TRNG Statistical Check Poker Count 3 and 2 Register */
/*! @{ */

#define CAAM_RTPKRCNT32_PKR_2_CNT_MASK           (0xFFFFU)
#define CAAM_RTPKRCNT32_PKR_2_CNT_SHIFT          (0U)
#define CAAM_RTPKRCNT32_PKR_2_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT32_PKR_2_CNT_SHIFT)) & CAAM_RTPKRCNT32_PKR_2_CNT_MASK)

#define CAAM_RTPKRCNT32_PKR_3_CNT_MASK           (0xFFFF0000U)
#define CAAM_RTPKRCNT32_PKR_3_CNT_SHIFT          (16U)
#define CAAM_RTPKRCNT32_PKR_3_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT32_PKR_3_CNT_SHIFT)) & CAAM_RTPKRCNT32_PKR_3_CNT_MASK)
/*! @} */

/*! @name RTPKRCNT54 - RNG TRNG Statistical Check Poker Count 5 and 4 Register */
/*! @{ */

#define CAAM_RTPKRCNT54_PKR_4_CNT_MASK           (0xFFFFU)
#define CAAM_RTPKRCNT54_PKR_4_CNT_SHIFT          (0U)
#define CAAM_RTPKRCNT54_PKR_4_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT54_PKR_4_CNT_SHIFT)) & CAAM_RTPKRCNT54_PKR_4_CNT_MASK)

#define CAAM_RTPKRCNT54_PKR_5_CNT_MASK           (0xFFFF0000U)
#define CAAM_RTPKRCNT54_PKR_5_CNT_SHIFT          (16U)
#define CAAM_RTPKRCNT54_PKR_5_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT54_PKR_5_CNT_SHIFT)) & CAAM_RTPKRCNT54_PKR_5_CNT_MASK)
/*! @} */

/*! @name RTPKRCNT76 - RNG TRNG Statistical Check Poker Count 7 and 6 Register */
/*! @{ */

#define CAAM_RTPKRCNT76_PKR_6_CNT_MASK           (0xFFFFU)
#define CAAM_RTPKRCNT76_PKR_6_CNT_SHIFT          (0U)
#define CAAM_RTPKRCNT76_PKR_6_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT76_PKR_6_CNT_SHIFT)) & CAAM_RTPKRCNT76_PKR_6_CNT_MASK)

#define CAAM_RTPKRCNT76_PKR_7_CNT_MASK           (0xFFFF0000U)
#define CAAM_RTPKRCNT76_PKR_7_CNT_SHIFT          (16U)
#define CAAM_RTPKRCNT76_PKR_7_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT76_PKR_7_CNT_SHIFT)) & CAAM_RTPKRCNT76_PKR_7_CNT_MASK)
/*! @} */

/*! @name RTPKRCNT98 - RNG TRNG Statistical Check Poker Count 9 and 8 Register */
/*! @{ */

#define CAAM_RTPKRCNT98_PKR_8_CNT_MASK           (0xFFFFU)
#define CAAM_RTPKRCNT98_PKR_8_CNT_SHIFT          (0U)
#define CAAM_RTPKRCNT98_PKR_8_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT98_PKR_8_CNT_SHIFT)) & CAAM_RTPKRCNT98_PKR_8_CNT_MASK)

#define CAAM_RTPKRCNT98_PKR_9_CNT_MASK           (0xFFFF0000U)
#define CAAM_RTPKRCNT98_PKR_9_CNT_SHIFT          (16U)
#define CAAM_RTPKRCNT98_PKR_9_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNT98_PKR_9_CNT_SHIFT)) & CAAM_RTPKRCNT98_PKR_9_CNT_MASK)
/*! @} */

/*! @name RTPKRCNTBA - RNG TRNG Statistical Check Poker Count B and A Register */
/*! @{ */

#define CAAM_RTPKRCNTBA_PKR_A_CNT_MASK           (0xFFFFU)
#define CAAM_RTPKRCNTBA_PKR_A_CNT_SHIFT          (0U)
#define CAAM_RTPKRCNTBA_PKR_A_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNTBA_PKR_A_CNT_SHIFT)) & CAAM_RTPKRCNTBA_PKR_A_CNT_MASK)

#define CAAM_RTPKRCNTBA_PKR_B_CNT_MASK           (0xFFFF0000U)
#define CAAM_RTPKRCNTBA_PKR_B_CNT_SHIFT          (16U)
#define CAAM_RTPKRCNTBA_PKR_B_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNTBA_PKR_B_CNT_SHIFT)) & CAAM_RTPKRCNTBA_PKR_B_CNT_MASK)
/*! @} */

/*! @name RTPKRCNTDC - RNG TRNG Statistical Check Poker Count D and C Register */
/*! @{ */

#define CAAM_RTPKRCNTDC_PKR_C_CNT_MASK           (0xFFFFU)
#define CAAM_RTPKRCNTDC_PKR_C_CNT_SHIFT          (0U)
#define CAAM_RTPKRCNTDC_PKR_C_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNTDC_PKR_C_CNT_SHIFT)) & CAAM_RTPKRCNTDC_PKR_C_CNT_MASK)

#define CAAM_RTPKRCNTDC_PKR_D_CNT_MASK           (0xFFFF0000U)
#define CAAM_RTPKRCNTDC_PKR_D_CNT_SHIFT          (16U)
#define CAAM_RTPKRCNTDC_PKR_D_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNTDC_PKR_D_CNT_SHIFT)) & CAAM_RTPKRCNTDC_PKR_D_CNT_MASK)
/*! @} */

/*! @name RTPKRCNTFE - RNG TRNG Statistical Check Poker Count F and E Register */
/*! @{ */

#define CAAM_RTPKRCNTFE_PKR_E_CNT_MASK           (0xFFFFU)
#define CAAM_RTPKRCNTFE_PKR_E_CNT_SHIFT          (0U)
#define CAAM_RTPKRCNTFE_PKR_E_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNTFE_PKR_E_CNT_SHIFT)) & CAAM_RTPKRCNTFE_PKR_E_CNT_MASK)

#define CAAM_RTPKRCNTFE_PKR_F_CNT_MASK           (0xFFFF0000U)
#define CAAM_RTPKRCNTFE_PKR_F_CNT_SHIFT          (16U)
#define CAAM_RTPKRCNTFE_PKR_F_CNT(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_RTPKRCNTFE_PKR_F_CNT_SHIFT)) & CAAM_RTPKRCNTFE_PKR_F_CNT_MASK)
/*! @} */

/*! @name RDSTA - RNG DRNG Status Register */
/*! @{ */

#define CAAM_RDSTA_IF0_MASK                      (0x1U)
#define CAAM_RDSTA_IF0_SHIFT                     (0U)
#define CAAM_RDSTA_IF0(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_IF0_SHIFT)) & CAAM_RDSTA_IF0_MASK)

#define CAAM_RDSTA_IF1_MASK                      (0x2U)
#define CAAM_RDSTA_IF1_SHIFT                     (1U)
#define CAAM_RDSTA_IF1(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_IF1_SHIFT)) & CAAM_RDSTA_IF1_MASK)

#define CAAM_RDSTA_PR0_MASK                      (0x10U)
#define CAAM_RDSTA_PR0_SHIFT                     (4U)
#define CAAM_RDSTA_PR0(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_PR0_SHIFT)) & CAAM_RDSTA_PR0_MASK)

#define CAAM_RDSTA_PR1_MASK                      (0x20U)
#define CAAM_RDSTA_PR1_SHIFT                     (5U)
#define CAAM_RDSTA_PR1(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_PR1_SHIFT)) & CAAM_RDSTA_PR1_MASK)

#define CAAM_RDSTA_TF0_MASK                      (0x100U)
#define CAAM_RDSTA_TF0_SHIFT                     (8U)
#define CAAM_RDSTA_TF0(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_RDSTA_TF0_SHIFT)) & CAAM_RDSTA_TF0_MASK)

