Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
#define CAAM_PX_SMAG2_PG0_Gx_ID26_MASK           (0x4000000U)
#define CAAM_PX_SMAG2_PG0_Gx_ID26_SHIFT          (26U)
#define CAAM_PX_SMAG2_PG0_Gx_ID26(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG2_PG0_Gx_ID26_SHIFT)) & CAAM_PX_SMAG2_PG0_Gx_ID26_MASK)

#define CAAM_PX_SMAG2_PG0_Gx_ID27_MASK           (0x8000000U)
#define CAAM_PX_SMAG2_PG0_Gx_ID27_SHIFT          (27U)
#define CAAM_PX_SMAG2_PG0_Gx_ID27(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG2_PG0_Gx_ID27_SHIFT)) & CAAM_PX_SMAG2_PG0_Gx_ID27_MASK)

#define CAAM_PX_SMAG2_PG0_Gx_ID28_MASK           (0x10000000U)
#define CAAM_PX_SMAG2_PG0_Gx_ID28_SHIFT          (28U)
#define CAAM_PX_SMAG2_PG0_Gx_ID28(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG2_PG0_Gx_ID28_SHIFT)) & CAAM_PX_SMAG2_PG0_Gx_ID28_MASK)

#define CAAM_PX_SMAG2_PG0_Gx_ID29_MASK           (0x20000000U)
#define CAAM_PX_SMAG2_PG0_Gx_ID29_SHIFT          (29U)
#define CAAM_PX_SMAG2_PG0_Gx_ID29(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG2_PG0_Gx_ID29_SHIFT)) & CAAM_PX_SMAG2_PG0_Gx_ID29_MASK)

#define CAAM_PX_SMAG2_PG0_Gx_ID30_MASK           (0x40000000U)
#define CAAM_PX_SMAG2_PG0_Gx_ID30_SHIFT          (30U)
#define CAAM_PX_SMAG2_PG0_Gx_ID30(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG2_PG0_Gx_ID30_SHIFT)) & CAAM_PX_SMAG2_PG0_Gx_ID30_MASK)

#define CAAM_PX_SMAG2_PG0_Gx_ID31_MASK           (0x80000000U)
#define CAAM_PX_SMAG2_PG0_Gx_ID31_SHIFT          (31U)
#define CAAM_PX_SMAG2_PG0_Gx_ID31(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG2_PG0_Gx_ID31_SHIFT)) & CAAM_PX_SMAG2_PG0_Gx_ID31_MASK)
/*! @} */

/* The count of CAAM_PX_SMAG2_PG0 */
#define CAAM_PX_SMAG2_PG0_COUNT                  (16U)

/*! @name PX_SMAG1_PG0 - Secure Memory Access Group Registers */
/*! @{ */

#define CAAM_PX_SMAG1_PG0_Gx_ID00_MASK           (0x1U)
#define CAAM_PX_SMAG1_PG0_Gx_ID00_SHIFT          (0U)
#define CAAM_PX_SMAG1_PG0_Gx_ID00(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID00_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID00_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID01_MASK           (0x2U)
#define CAAM_PX_SMAG1_PG0_Gx_ID01_SHIFT          (1U)
#define CAAM_PX_SMAG1_PG0_Gx_ID01(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID01_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID01_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID02_MASK           (0x4U)
#define CAAM_PX_SMAG1_PG0_Gx_ID02_SHIFT          (2U)
#define CAAM_PX_SMAG1_PG0_Gx_ID02(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID02_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID02_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID03_MASK           (0x8U)
#define CAAM_PX_SMAG1_PG0_Gx_ID03_SHIFT          (3U)
#define CAAM_PX_SMAG1_PG0_Gx_ID03(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID03_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID03_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID04_MASK           (0x10U)
#define CAAM_PX_SMAG1_PG0_Gx_ID04_SHIFT          (4U)
#define CAAM_PX_SMAG1_PG0_Gx_ID04(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID04_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID04_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID05_MASK           (0x20U)
#define CAAM_PX_SMAG1_PG0_Gx_ID05_SHIFT          (5U)
#define CAAM_PX_SMAG1_PG0_Gx_ID05(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID05_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID05_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID06_MASK           (0x40U)
#define CAAM_PX_SMAG1_PG0_Gx_ID06_SHIFT          (6U)
#define CAAM_PX_SMAG1_PG0_Gx_ID06(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID06_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID06_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID07_MASK           (0x80U)
#define CAAM_PX_SMAG1_PG0_Gx_ID07_SHIFT          (7U)
#define CAAM_PX_SMAG1_PG0_Gx_ID07(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID07_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID07_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID08_MASK           (0x100U)
#define CAAM_PX_SMAG1_PG0_Gx_ID08_SHIFT          (8U)
#define CAAM_PX_SMAG1_PG0_Gx_ID08(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID08_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID08_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID09_MASK           (0x200U)
#define CAAM_PX_SMAG1_PG0_Gx_ID09_SHIFT          (9U)
#define CAAM_PX_SMAG1_PG0_Gx_ID09(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID09_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID09_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID10_MASK           (0x400U)
#define CAAM_PX_SMAG1_PG0_Gx_ID10_SHIFT          (10U)
#define CAAM_PX_SMAG1_PG0_Gx_ID10(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID10_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID10_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID11_MASK           (0x800U)
#define CAAM_PX_SMAG1_PG0_Gx_ID11_SHIFT          (11U)
#define CAAM_PX_SMAG1_PG0_Gx_ID11(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID11_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID11_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID12_MASK           (0x1000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID12_SHIFT          (12U)
#define CAAM_PX_SMAG1_PG0_Gx_ID12(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID12_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID12_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID13_MASK           (0x2000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID13_SHIFT          (13U)
#define CAAM_PX_SMAG1_PG0_Gx_ID13(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID13_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID13_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID14_MASK           (0x4000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID14_SHIFT          (14U)
#define CAAM_PX_SMAG1_PG0_Gx_ID14(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID14_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID14_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID15_MASK           (0x8000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID15_SHIFT          (15U)
#define CAAM_PX_SMAG1_PG0_Gx_ID15(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID15_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID15_MASK)

#define CAAM_PX_SMAG1_PG0_Gx_ID16_MASK           (0x10000U)
#define CAAM_PX_SMAG1_PG0_Gx_ID16_SHIFT          (16U)
#define CAAM_PX_SMAG1_PG0_Gx_ID16(x)             (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_PG0_Gx_ID16_SHIFT)) & CAAM_PX_SMAG1_PG0_Gx_ID16_MASK)

