Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
#define CAAM_PX_SMAG1_JR_Gx_ID23_MASK            (0x800000U)
#define CAAM_PX_SMAG1_JR_Gx_ID23_SHIFT           (23U)
#define CAAM_PX_SMAG1_JR_Gx_ID23(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_JR_Gx_ID23_SHIFT)) & CAAM_PX_SMAG1_JR_Gx_ID23_MASK)

#define CAAM_PX_SMAG1_JR_Gx_ID24_MASK            (0x1000000U)
#define CAAM_PX_SMAG1_JR_Gx_ID24_SHIFT           (24U)
#define CAAM_PX_SMAG1_JR_Gx_ID24(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_JR_Gx_ID24_SHIFT)) & CAAM_PX_SMAG1_JR_Gx_ID24_MASK)

#define CAAM_PX_SMAG1_JR_Gx_ID25_MASK            (0x2000000U)
#define CAAM_PX_SMAG1_JR_Gx_ID25_SHIFT           (25U)
#define CAAM_PX_SMAG1_JR_Gx_ID25(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_JR_Gx_ID25_SHIFT)) & CAAM_PX_SMAG1_JR_Gx_ID25_MASK)

#define CAAM_PX_SMAG1_JR_Gx_ID26_MASK            (0x4000000U)
#define CAAM_PX_SMAG1_JR_Gx_ID26_SHIFT           (26U)
#define CAAM_PX_SMAG1_JR_Gx_ID26(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_JR_Gx_ID26_SHIFT)) & CAAM_PX_SMAG1_JR_Gx_ID26_MASK)

#define CAAM_PX_SMAG1_JR_Gx_ID27_MASK            (0x8000000U)
#define CAAM_PX_SMAG1_JR_Gx_ID27_SHIFT           (27U)
#define CAAM_PX_SMAG1_JR_Gx_ID27(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_JR_Gx_ID27_SHIFT)) & CAAM_PX_SMAG1_JR_Gx_ID27_MASK)

#define CAAM_PX_SMAG1_JR_Gx_ID28_MASK            (0x10000000U)
#define CAAM_PX_SMAG1_JR_Gx_ID28_SHIFT           (28U)
#define CAAM_PX_SMAG1_JR_Gx_ID28(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_JR_Gx_ID28_SHIFT)) & CAAM_PX_SMAG1_JR_Gx_ID28_MASK)

#define CAAM_PX_SMAG1_JR_Gx_ID29_MASK            (0x20000000U)
#define CAAM_PX_SMAG1_JR_Gx_ID29_SHIFT           (29U)
#define CAAM_PX_SMAG1_JR_Gx_ID29(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_JR_Gx_ID29_SHIFT)) & CAAM_PX_SMAG1_JR_Gx_ID29_MASK)

#define CAAM_PX_SMAG1_JR_Gx_ID30_MASK            (0x40000000U)
#define CAAM_PX_SMAG1_JR_Gx_ID30_SHIFT           (30U)
#define CAAM_PX_SMAG1_JR_Gx_ID30(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_JR_Gx_ID30_SHIFT)) & CAAM_PX_SMAG1_JR_Gx_ID30_MASK)

#define CAAM_PX_SMAG1_JR_Gx_ID31_MASK            (0x80000000U)
#define CAAM_PX_SMAG1_JR_Gx_ID31_SHIFT           (31U)
#define CAAM_PX_SMAG1_JR_Gx_ID31(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_PX_SMAG1_JR_Gx_ID31_SHIFT)) & CAAM_PX_SMAG1_JR_Gx_ID31_MASK)
/*! @} */

/* The count of CAAM_PX_SMAG1_JR */
#define CAAM_PX_SMAG1_JR_COUNT                   (4U)

/* The count of CAAM_PX_SMAG1_JR */
#define CAAM_PX_SMAG1_JR_COUNT2                  (16U)

/*! @name SMCR_JR - Secure Memory Command Register */
/*! @{ */

#define CAAM_SMCR_JR_CMD_MASK                    (0xFU)
#define CAAM_SMCR_JR_CMD_SHIFT                   (0U)
#define CAAM_SMCR_JR_CMD(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_SMCR_JR_CMD_SHIFT)) & CAAM_SMCR_JR_CMD_MASK)

#define CAAM_SMCR_JR_PRTN_MASK                   (0xF00U)
#define CAAM_SMCR_JR_PRTN_SHIFT                  (8U)
#define CAAM_SMCR_JR_PRTN(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_SMCR_JR_PRTN_SHIFT)) & CAAM_SMCR_JR_PRTN_MASK)

#define CAAM_SMCR_JR_PAGE_MASK                   (0xFFFF0000U)
#define CAAM_SMCR_JR_PAGE_SHIFT                  (16U)
#define CAAM_SMCR_JR_PAGE(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_SMCR_JR_PAGE_SHIFT)) & CAAM_SMCR_JR_PAGE_MASK)
/*! @} */

/* The count of CAAM_SMCR_JR */
#define CAAM_SMCR_JR_COUNT                       (4U)

/*! @name SMCSR_JR - Secure Memory Command Status Register */
/*! @{ */

#define CAAM_SMCSR_JR_PRTN_MASK                  (0xFU)
#define CAAM_SMCSR_JR_PRTN_SHIFT                 (0U)
#define CAAM_SMCSR_JR_PRTN(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_JR_PRTN_SHIFT)) & CAAM_SMCSR_JR_PRTN_MASK)

#define CAAM_SMCSR_JR_PO_MASK                    (0xC0U)
#define CAAM_SMCSR_JR_PO_SHIFT                   (6U)
/*! PO
 *  0b00..Available; Unowned: The entity that issued the inquiry may allocate this page to a partition. No
 *        zeroization is needed since it has already been cleared, therefore no interrupt should be expected.
 *  0b01..Page does not exist in this version or is not initialized yet.
 *  0b10..Another entity owns the page. This page is unavailable to the issuer of the inquiry.
 *  0b11..Owned by the entity making the inquiry. The owner may de-allocate this page if its partition is not
 *        marked PSP. If the partition to which the page is allocated is designated as CSP, the page will be zeroized
 *        upon de-allocation.
 */
#define CAAM_SMCSR_JR_PO(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_JR_PO_SHIFT)) & CAAM_SMCSR_JR_PO_MASK)

#define CAAM_SMCSR_JR_AERR_MASK                  (0x3000U)
#define CAAM_SMCSR_JR_AERR_SHIFT                 (12U)
#define CAAM_SMCSR_JR_AERR(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_JR_AERR_SHIFT)) & CAAM_SMCSR_JR_AERR_MASK)

#define CAAM_SMCSR_JR_CERR_MASK                  (0xC000U)
#define CAAM_SMCSR_JR_CERR_SHIFT                 (14U)
/*! CERR
 *  0b00..No Error.
 *  0b01..Command has not yet completed.
 *  0b10..A security failure occurred.
 *  0b11..Command Overflow. Another command was issued by the same Job Ring owner before the owner's previous
 *        command completed. The additional command was ignored.
 */
#define CAAM_SMCSR_JR_CERR(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_JR_CERR_SHIFT)) & CAAM_SMCSR_JR_CERR_MASK)

#define CAAM_SMCSR_JR_PAGE_MASK                  (0xFFF0000U)
#define CAAM_SMCSR_JR_PAGE_SHIFT                 (16U)
#define CAAM_SMCSR_JR_PAGE(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_SMCSR_JR_PAGE_SHIFT)) & CAAM_SMCSR_JR_PAGE_MASK)
/*! @} */

/* The count of CAAM_SMCSR_JR */
#define CAAM_SMCSR_JR_COUNT                      (4U)

/*! @name REIR0JR - Recoverable Error Interrupt Record 0 for Job Ring 0..Recoverable Error Interrupt Record 0 for Job Ring 3 */
/*! @{ */

#define CAAM_REIR0JR_TYPE_MASK                   (0x3000000U)
#define CAAM_REIR0JR_TYPE_SHIFT                  (24U)
#define CAAM_REIR0JR_TYPE(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_REIR0JR_TYPE_SHIFT)) & CAAM_REIR0JR_TYPE_MASK)

