Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
#define CAAM_CC1CTXR_C1CTX_MASK                  (0xFFFFFFFFU)
#define CAAM_CC1CTXR_C1CTX_SHIFT                 (0U)
#define CAAM_CC1CTXR_C1CTX(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CC1CTXR_C1CTX_SHIFT)) & CAAM_CC1CTXR_C1CTX_MASK)
/*! @} */

/* The count of CAAM_CC1CTXR */
#define CAAM_CC1CTXR_COUNT                       (1U)

/* The count of CAAM_CC1CTXR */
#define CAAM_CC1CTXR_COUNT2                      (16U)

/*! @name CC1KR - CCB 0 Class 1 Key Registers Word 0..CCB 0 Class 1 Key Registers Word 7 */
/*! @{ */

#define CAAM_CC1KR_C1KEY_MASK                    (0xFFFFFFFFU)
#define CAAM_CC1KR_C1KEY_SHIFT                   (0U)
#define CAAM_CC1KR_C1KEY(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CC1KR_C1KEY_SHIFT)) & CAAM_CC1KR_C1KEY_MASK)
/*! @} */

/* The count of CAAM_CC1KR */
#define CAAM_CC1KR_COUNT                         (1U)

/* The count of CAAM_CC1KR */
#define CAAM_CC1KR_COUNT2                        (8U)

/*! @name CC2MR - CCB 0 Class 2 Mode Register */
/*! @{ */

#define CAAM_CC2MR_AP_MASK                       (0x1U)
#define CAAM_CC2MR_AP_SHIFT                      (0U)
/*! AP
 *  0b0..Authenticate
 *  0b1..Protect
 */
#define CAAM_CC2MR_AP(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CC2MR_AP_SHIFT)) & CAAM_CC2MR_AP_MASK)

#define CAAM_CC2MR_ICV_MASK                      (0x2U)
#define CAAM_CC2MR_ICV_SHIFT                     (1U)
/*! ICV
 *  0b0..Don't compare the calculated ICV against a received ICV.
 *  0b1..Compare the calculated ICV against a received ICV.
 */
#define CAAM_CC2MR_ICV(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CC2MR_ICV_SHIFT)) & CAAM_CC2MR_ICV_MASK)

#define CAAM_CC2MR_AS_MASK                       (0xCU)
#define CAAM_CC2MR_AS_SHIFT                      (2U)
/*! AS
 *  0b00..Update.
 *  0b01..Initialize.
 *  0b10..Finalize.
 *  0b11..Initialize/Finalize.
 */
#define CAAM_CC2MR_AS(x)                         (((uint32_t)(((uint32_t)(x)) << CAAM_CC2MR_AS_SHIFT)) & CAAM_CC2MR_AS_MASK)

#define CAAM_CC2MR_AAI_MASK                      (0x1FF0U)
#define CAAM_CC2MR_AAI_SHIFT                     (4U)
#define CAAM_CC2MR_AAI(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CC2MR_AAI_SHIFT)) & CAAM_CC2MR_AAI_MASK)

#define CAAM_CC2MR_ALG_MASK                      (0xFF0000U)
#define CAAM_CC2MR_ALG_SHIFT                     (16U)
/*! ALG
 *  0b01000000..MD5
 *  0b01000001..SHA-1
 *  0b01000010..SHA-224
 *  0b01000011..SHA-256
 *  0b01000100..SHA-384
 *  0b01000101..SHA-512
 *  0b01000110..SHA-512/224
 *  0b01000111..SHA-512/256
 *  0b10010000..CRC
 */
#define CAAM_CC2MR_ALG(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CC2MR_ALG_SHIFT)) & CAAM_CC2MR_ALG_MASK)
/*! @} */

/* The count of CAAM_CC2MR */
#define CAAM_CC2MR_COUNT                         (1U)

/*! @name CC2KSR - CCB 0 Class 2 Key Size Register */
/*! @{ */

#define CAAM_CC2KSR_C2KS_MASK                    (0xFFU)
#define CAAM_CC2KSR_C2KS_SHIFT                   (0U)
#define CAAM_CC2KSR_C2KS(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CC2KSR_C2KS_SHIFT)) & CAAM_CC2KSR_C2KS_MASK)
/*! @} */

/* The count of CAAM_CC2KSR */
#define CAAM_CC2KSR_COUNT                        (1U)

/*! @name CC2DSR - CCB 0 Class 2 Data Size Register */
/*! @{ */

#define CAAM_CC2DSR_C2DS_MASK                    (0xFFFFFFFFU)
#define CAAM_CC2DSR_C2DS_SHIFT                   (0U)
#define CAAM_CC2DSR_C2DS(x)                      (((uint64_t)(((uint64_t)(x)) << CAAM_CC2DSR_C2DS_SHIFT)) & CAAM_CC2DSR_C2DS_MASK)

#define CAAM_CC2DSR_C2CY_MASK                    (0x100000000U)
#define CAAM_CC2DSR_C2CY_SHIFT                   (32U)
/*! C2CY
 *  0b0..A write to the Class 2 Data Size Register did not cause a carry.
 *  0b1..A write to the Class 2 Data Size Register caused a carry.
 */
#define CAAM_CC2DSR_C2CY(x)                      (((uint64_t)(((uint64_t)(x)) << CAAM_CC2DSR_C2CY_SHIFT)) & CAAM_CC2DSR_C2CY_MASK)

#define CAAM_CC2DSR_NUMBITS_MASK                 (0xE000000000000000U)
#define CAAM_CC2DSR_NUMBITS_SHIFT                (61U)
#define CAAM_CC2DSR_NUMBITS(x)                   (((uint64_t)(((uint64_t)(x)) << CAAM_CC2DSR_NUMBITS_SHIFT)) & CAAM_CC2DSR_NUMBITS_MASK)
/*! @} */

/* The count of CAAM_CC2DSR */
#define CAAM_CC2DSR_COUNT                        (1U)

/*! @name CC2ICVSZR - CCB 0 Class 2 ICV Size Register */
/*! @{ */

#define CAAM_CC2ICVSZR_ICVSZ_MASK                (0xFU)
#define CAAM_CC2ICVSZR_ICVSZ_SHIFT               (0U)
#define CAAM_CC2ICVSZR_ICVSZ(x)                  (((uint32_t)(((uint32_t)(x)) << CAAM_CC2ICVSZR_ICVSZ_SHIFT)) & CAAM_CC2ICVSZR_ICVSZ_MASK)
/*! @} */

/* The count of CAAM_CC2ICVSZR */
#define CAAM_CC2ICVSZR_COUNT                     (1U)

/*! @name CC2CTXR - CCB 0 Class 2 Context Register Word 0..CCB 0 Class 2 Context Register Word 17 */
/*! @{ */

#define CAAM_CC2CTXR_C2CTXR_MASK                 (0xFFFFFFFFU)
#define CAAM_CC2CTXR_C2CTXR_SHIFT                (0U)
#define CAAM_CC2CTXR_C2CTXR(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CC2CTXR_C2CTXR_SHIFT)) & CAAM_CC2CTXR_C2CTXR_MASK)
/*! @} */

/* The count of CAAM_CC2CTXR */
#define CAAM_CC2CTXR_COUNT                       (1U)

/* The count of CAAM_CC2CTXR */
#define CAAM_CC2CTXR_COUNT2                      (18U)

/*! @name CC2KEYR - CCB 0 Class 2 Key Register Word 0..CCB 0 Class 2 Key Register Word 31 */
/*! @{ */

#define CAAM_CC2KEYR_C2KEY_MASK                  (0xFFFFFFFFU)
#define CAAM_CC2KEYR_C2KEY_SHIFT                 (0U)
#define CAAM_CC2KEYR_C2KEY(x)                    (((uint32_t)(((uint32_t)(x)) << CAAM_CC2KEYR_C2KEY_SHIFT)) & CAAM_CC2KEYR_C2KEY_MASK)
/*! @} */

/* The count of CAAM_CC2KEYR */
#define CAAM_CC2KEYR_COUNT                       (1U)

/* The count of CAAM_CC2KEYR */
#define CAAM_CC2KEYR_COUNT2                      (32U)

/*! @name CFIFOSTA - CCB 0 FIFO Status Register */
/*! @{ */

#define CAAM_CFIFOSTA_DECOOQHEAD_MASK            (0xFFU)
#define CAAM_CFIFOSTA_DECOOQHEAD_SHIFT           (0U)
#define CAAM_CFIFOSTA_DECOOQHEAD(x)              (((uint32_t)(((uint32_t)(x)) << CAAM_CFIFOSTA_DECOOQHEAD_SHIFT)) & CAAM_CFIFOSTA_DECOOQHEAD_MASK)

#define CAAM_CFIFOSTA_DMAOQHEAD_MASK             (0xFF00U)
#define CAAM_CFIFOSTA_DMAOQHEAD_SHIFT            (8U)
#define CAAM_CFIFOSTA_DMAOQHEAD(x)               (((uint32_t)(((uint32_t)(x)) << CAAM_CFIFOSTA_DMAOQHEAD_SHIFT)) & CAAM_CFIFOSTA_DMAOQHEAD_MASK)

#define CAAM_CFIFOSTA_C2IQHEAD_MASK              (0xFF0000U)
#define CAAM_CFIFOSTA_C2IQHEAD_SHIFT             (16U)
#define CAAM_CFIFOSTA_C2IQHEAD(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CFIFOSTA_C2IQHEAD_SHIFT)) & CAAM_CFIFOSTA_C2IQHEAD_MASK)

#define CAAM_CFIFOSTA_C1IQHEAD_MASK              (0xFF000000U)
#define CAAM_CFIFOSTA_C1IQHEAD_SHIFT             (24U)
#define CAAM_CFIFOSTA_C1IQHEAD(x)                (((uint32_t)(((uint32_t)(x)) << CAAM_CFIFOSTA_C1IQHEAD_SHIFT)) & CAAM_CFIFOSTA_C1IQHEAD_MASK)
/*! @} */

/* The count of CAAM_CFIFOSTA */
#define CAAM_CFIFOSTA_COUNT                      (1U)

