Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1170/periph/PERI_CAAM.h
/*! @name CNFIFO - CCB 0 iNformation FIFO When STYPE != 10b */
/*! @{ */

#define CAAM_CNFIFO_DL_MASK                      (0xFFFU)
#define CAAM_CNFIFO_DL_SHIFT                     (0U)
#define CAAM_CNFIFO_DL(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_DL_SHIFT)) & CAAM_CNFIFO_DL_MASK)

#define CAAM_CNFIFO_AST_MASK                     (0x4000U)
#define CAAM_CNFIFO_AST_SHIFT                    (14U)
#define CAAM_CNFIFO_AST(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_AST_SHIFT)) & CAAM_CNFIFO_AST_MASK)

#define CAAM_CNFIFO_OC_MASK                      (0x8000U)
#define CAAM_CNFIFO_OC_SHIFT                     (15U)
/*! OC
 *  0b0..Allow the final word to be popped from the Output Data FIFO.
 *  0b1..Don't pop the final word from the Output Data FIFO.
 */
#define CAAM_CNFIFO_OC(x)                        (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_OC_SHIFT)) & CAAM_CNFIFO_OC_MASK)

#define CAAM_CNFIFO_PTYPE_MASK                   (0x70000U)
#define CAAM_CNFIFO_PTYPE_SHIFT                  (16U)
#define CAAM_CNFIFO_PTYPE(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_PTYPE_SHIFT)) & CAAM_CNFIFO_PTYPE_MASK)

#define CAAM_CNFIFO_BND_MASK                     (0x80000U)
#define CAAM_CNFIFO_BND_SHIFT                    (19U)
/*! BND
 *  0b0..Don't pad.
 *  0b1..Pad to the next 16-byte boundary.
 */
#define CAAM_CNFIFO_BND(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_BND_SHIFT)) & CAAM_CNFIFO_BND_MASK)

#define CAAM_CNFIFO_DTYPE_MASK                   (0xF00000U)
#define CAAM_CNFIFO_DTYPE_SHIFT                  (20U)
#define CAAM_CNFIFO_DTYPE(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_DTYPE_SHIFT)) & CAAM_CNFIFO_DTYPE_MASK)

#define CAAM_CNFIFO_STYPE_MASK                   (0x3000000U)
#define CAAM_CNFIFO_STYPE_SHIFT                  (24U)
#define CAAM_CNFIFO_STYPE(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_STYPE_SHIFT)) & CAAM_CNFIFO_STYPE_MASK)

#define CAAM_CNFIFO_FC1_MASK                     (0x4000000U)
#define CAAM_CNFIFO_FC1_SHIFT                    (26U)
/*! FC1
 *  0b0..Don't flush Class 1 data.
 *  0b1..Flush Class 1 data.
 */
#define CAAM_CNFIFO_FC1(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_FC1_SHIFT)) & CAAM_CNFIFO_FC1_MASK)

#define CAAM_CNFIFO_FC2_MASK                     (0x8000000U)
#define CAAM_CNFIFO_FC2_SHIFT                    (27U)
/*! FC2
 *  0b0..Don't flush Class 2 data.
 *  0b1..Flush Class 2 data.
 */
#define CAAM_CNFIFO_FC2(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_FC2_SHIFT)) & CAAM_CNFIFO_FC2_MASK)

#define CAAM_CNFIFO_LC1_MASK                     (0x10000000U)
#define CAAM_CNFIFO_LC1_SHIFT                    (28U)
/*! LC1
 *  0b0..This is not the last Class 1 data.
 *  0b1..This is the last Class 1 data.
 */
#define CAAM_CNFIFO_LC1(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_LC1_SHIFT)) & CAAM_CNFIFO_LC1_MASK)

#define CAAM_CNFIFO_LC2_MASK                     (0x20000000U)
#define CAAM_CNFIFO_LC2_SHIFT                    (29U)
/*! LC2
 *  0b0..This is not the last Class 2 data.
 *  0b1..This is the last Class 2 data.
 */
#define CAAM_CNFIFO_LC2(x)                       (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_LC2_SHIFT)) & CAAM_CNFIFO_LC2_MASK)

#define CAAM_CNFIFO_DEST_MASK                    (0xC0000000U)
#define CAAM_CNFIFO_DEST_SHIFT                   (30U)
/*! DEST
 *  0b00..DECO Alignment Block. If DTYPE == Eh, data sent to the DECO Alignment Block is dropped. This is used to
 *        skip over input data. An error is generated if a DTYPE other than Eh (drop) or Fh (message) is used with
 *        the DECO Alignment Block destination.
 *  0b01..Class 1.
 *  0b10..Class 2.
 *  0b11..Both Class 1 and Class 2.
 */
#define CAAM_CNFIFO_DEST(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_DEST_SHIFT)) & CAAM_CNFIFO_DEST_MASK)
/*! @} */

/* The count of CAAM_CNFIFO */
#define CAAM_CNFIFO_COUNT                        (1U)

/*! @name CNFIFO_2 - CCB 0 iNformation FIFO When STYPE == 10b */
/*! @{ */

#define CAAM_CNFIFO_2_PL_MASK                    (0x7FU)
#define CAAM_CNFIFO_2_PL_SHIFT                   (0U)
#define CAAM_CNFIFO_2_PL(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_PL_SHIFT)) & CAAM_CNFIFO_2_PL_MASK)

#define CAAM_CNFIFO_2_PS_MASK                    (0x400U)
#define CAAM_CNFIFO_2_PS_SHIFT                   (10U)
/*! PS
 *  0b0..C2 CHA snoops pad data from padding block.
 *  0b1..C2 CHA snoops pad data from OFIFO.
 */
#define CAAM_CNFIFO_2_PS(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_PS_SHIFT)) & CAAM_CNFIFO_2_PS_MASK)

#define CAAM_CNFIFO_2_BM_MASK                    (0x800U)
#define CAAM_CNFIFO_2_BM_SHIFT                   (11U)
/*! BM
 *  0b0..When padding, pad to power-of-2 boundary.
 *  0b1..When padding, pad to power-of-2 boundary minus 1 byte.
 */
#define CAAM_CNFIFO_2_BM(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_BM_SHIFT)) & CAAM_CNFIFO_2_BM_MASK)

#define CAAM_CNFIFO_2_PR_MASK                    (0x8000U)
#define CAAM_CNFIFO_2_PR_SHIFT                   (15U)
/*! PR
 *  0b0..No prediction resistance.
 *  0b1..Prediction resistance.
 */
#define CAAM_CNFIFO_2_PR(x)                      (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_PR_SHIFT)) & CAAM_CNFIFO_2_PR_MASK)

#define CAAM_CNFIFO_2_PTYPE_MASK                 (0x70000U)
#define CAAM_CNFIFO_2_PTYPE_SHIFT                (16U)
/*! PTYPE
 *  0b000..All Zero.
 *  0b001..Random with nonzero bytes.
 *  0b010..Incremented (starting with 01h), followed by a byte containing the value N-1, i.e., if N==1, a single byte is output with value 0h.
 *  0b011..Random.
 *  0b100..All Zero with last byte containing the number of 0 bytes, i.e., if N==1, a single byte is output with value 0h.
 *  0b101..Random with nonzero bytes with last byte 0.
 *  0b110..N bytes of padding all containing the value N-1.
 *  0b111..Random with nonzero bytes, with the last byte containing the value N-1.
 */
#define CAAM_CNFIFO_2_PTYPE(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_PTYPE_SHIFT)) & CAAM_CNFIFO_2_PTYPE_MASK)

#define CAAM_CNFIFO_2_BND_MASK                   (0x80000U)
#define CAAM_CNFIFO_2_BND_SHIFT                  (19U)
/*! BND
 *  0b0..Don't add boundary padding.
 *  0b1..Add boundary padding.
 */
#define CAAM_CNFIFO_2_BND(x)                     (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_BND_SHIFT)) & CAAM_CNFIFO_2_BND_MASK)

#define CAAM_CNFIFO_2_DTYPE_MASK                 (0xF00000U)
#define CAAM_CNFIFO_2_DTYPE_SHIFT                (20U)
#define CAAM_CNFIFO_2_DTYPE(x)                   (((uint32_t)(((uint32_t)(x)) << CAAM_CNFIFO_2_DTYPE_SHIFT)) & CAAM_CNFIFO_2_DTYPE_MASK)

